//============================================================================================================
//
//  [Manager.cpp] Author : Masaki Kuboki
//
//============================================================================================================
#include "Manager.h"
#include "Mode.h"
#include "ModeTitle.h"
#include "ModeGame.h"

//============================================================================================================
//
// 静的変数
//
//============================================================================================================
CMode *CManager::m_Mode = nullptr;

//============================================================================================================
//
//
//
//============================================================================================================
CManager::CManager()
{

}

//============================================================================================================
// 
//
//
//============================================================================================================
CManager::~CManager()
{

}

//============================================================================================================
//
// Init 
// CScene2D::Create(hWnd,テクスチャ名, テクスチャサイズX,テクスチャサイズY, カラーRGBA, 0.0f,0.0f,スケールX, スケールY(0.5fで半分の大きさ), テクスチャの張り付け座標)
//
//============================================================================================================
bool CManager::Init(HINSTANCE hInstance, HWND hWnd, BOOL bWindow)
{
	CRendererDX::Init(hWnd, bWindow);	// DirectX

	CInput::InitKeyboard(hInstance, hWnd);	// キーボード初期化
	CXinput::Init(PLAYER_ONE,hWnd);
	C2D::Init(hWnd);	// 2D描画セット作成
	CSound::InitSound(hWnd);

	/*CModeGame *ModeGame = new CModeGame();
	ModeGame->Init();*/

	CManager::SetMode(new CModeTitle());

	return true/*S_OK*/;
}

//============================================================================================================
//
// Uninit
//
//============================================================================================================
void CManager::Uninit(void)
{
	CInput::UninitKeyboard();	// キーボード
	CXinput::Uninit();			// パッド
	C2D::Uninit();				// 2D描画セット
	CRendererDX::Uninit();		// DirectX
	CSound::UninitSound();		// サウンド
}

//============================================================================================================
//
// Update
//
//============================================================================================================
void CManager::Update(void)
{
	CInput::UpdateKeyboard();	// キーボード
	CXinput::Update();			// パッド
	C2D::Update();				// 2D描画セット
	CScene::UpdateAll();

	m_Mode->Update();
}

//============================================================================================================
//
// DrawBegin
//
//============================================================================================================
void CManager::Draw(void)
{
	CRendererDX::DrawBegin();
	
	CScene::DrawAll();
	m_Mode->Draw();

	CRendererDX::DrawEnd();		// DirectX
}

CSceneMeshField * CManager::GetField()
{
	return nullptr;
}


void CManager::SetMode(CMode *Mode)
{
	if (m_Mode != NULL)
	{
		m_Mode->Uninit();
		delete m_Mode;
	}

	m_Mode = Mode;

	if (m_Mode != NULL)
		m_Mode->Init();
}